dddema/P4-Cam/firmware/ReFocus_Camera/sdkconfig.defaults
# ReFocus Camera — ESP-IDF sdkconfig defaults
# Target: Waveshare ESP32-P4-WiFi6

# ── Chip revision (pre-v3 engineering sample: v0.x / v1.x) ───────────────
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# ── Core ─────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ── Flash & PSRAM ─────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ── Cache ─────────────────────────────────────────────────────────────────
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ── FreeRTOS ─────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# ── Compiler ─────────────────────────────────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ── Partition table ───────────────────────────────────────────────────────
# Increase bootloader partition offset to 0xC000 to accommodate the larger
# bootloader binary produced when esp_wifi_remote is included on ESP32-P4.
CONFIG_PARTITION_TABLE_OFFSET=0xC000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── Wi-Fi (SoftAP mode & Hosted Coprocessor) ──────────────────────────────
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_SLOT=1
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y


# ── LWIP (tune buffers for HTTP file streaming) ───────────────────────────
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_MAX_SOCKETS=16

# ── VFS ───────────────────────────────────────────────────────────────────
CONFIG_VFS_MAX_COUNT=10

# ── Camera (OV5647 via MIPI-CSI) ─────────────────────────────────────────
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X1280_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1920x1080_30FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW10_1920X1080_30FPS=y
CONFIG_CAMERA_OV5647_MIPI_IF_FORMAT_INDEX_DEFAULT=3
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_CAM_CTRL_SPI_ENABLE=n
CONFIG_TINYUSB_MSC_ENABLED=y

